#### 1.1[2]. Найдите сумму цифр трехзначного числа. Используйте f-строки чтобы оформить красивый вывод

# Например для числа 145 сумма цифр будет 10: 1 + 4 + 5

# 	Примеры/Тесты:
# 	123 >>> Сумма чисел числа 123 равна 6
# 	100 >>> Сумма чисел числа 100 равна 1

# ```(*)``` **Усложнение.** Решите для числа произвольной разрядности: произвольное количество цифр в числе.

# ```(**)``` **Усложнение.** Для числа произвольной разрядности добавить в вывод строку с числами, например так:
	
# 	13579 >>> Сумма чисел числа 13579 равна 25(1 + 3 + 5 + 7 + 9)
# Совет: Для этого используйте конкатенацию строк и срезы 

#Решение базовое
number=int(input("Введите трехзначное число "))
print(f'Сумма цифр числа {number} равна: {number%10 + number//100 + (number//10)%10}')


#Для произвольной разрядности
number =int(input("Введите число "))
add_number=number # дополнительная переменная для вывода числа, иначе выводит 0
sum_digit=0
while number!=0:
    sum_digit+=number%10
    number=number//10
print(f'Сумма цифр числа {add_number} равна {sum_digit}')

