# 1.2[4]. Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали ```S``` журавликов. 
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов, 
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

# 	Примеры/Тесты:
# 	6 >>>  1  4  1
# 	24 >>> 4  16  4
# 	60 >>> 10  40  10

crane= int(input('Введите общее колличество журавликов '))
Petr_crane = Serg_crane= int(crane/6)
Katya_crane = int(crane*2/3)
print(f' Петя - {Petr_crane},   Катя - {Katya_crane}, Сережа - {Serg_crane} журавликов')